In [1]:
import numpy as np
import pandas as pd

In [17]:
df = pd.read_csv("data/titanic/train.csv")
df.head(6)      
# df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [3]:
df.info()    # 返回当前 DataFrame 的信息

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [4]:
df.index     # 获取索引

RangeIndex(start=0, stop=891, step=1)

In [5]:
df.columns    # 获取列名

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df.values    # 返回一个 array

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [9]:
age = df['Age']     # 返回一个 pd.Series
age[:5]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [10]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [13]:
age.values[:10]

array([22., 38., 26., 35., 35., nan, 54.,  2., 27., 14.])

In [19]:
df2 = df.set_index('Name')     # 指定索引
df2.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
age = df2['Age']
age[:5]

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
Name: Age, dtype: float64

In [21]:
age['Heikkinen, Miss. Laina']

26.0

In [22]:
age = age * 10
age[:5]

Name
Braund, Mr. Owen Harris                                220.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    380.0
Heikkinen, Miss. Laina                                 260.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           350.0
Allen, Mr. William Henry                               350.0
Name: Age, dtype: float64

In [23]:
# loc: 用 label 定位, 可以是一个数, 也可以是一个字符串
# iloc: 用 position 定位, 必须是一个数

df2.iloc[0]       # 返回第一行数据

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
SibSp                  1
Parch                  0
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

In [24]:
df2.iloc[0 : 5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
df2.loc['Heikkinen, Miss. Laina', 'Ticket']

'STON/O2. 3101282'

In [26]:
df2.loc['Heikkinen, Miss. Laina' : 'Allen, Mr. William Henry']

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.100,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.050,NaN,S

In [27]:
df2['Fare'] > 40

Name
Braund, Mr. Owen Harris                                      False
Cumings, Mrs. John Bradley (Florence Briggs Thayer)           True
Heikkinen, Miss. Laina                                       False
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  True
Allen, Mr. William Henry                                     False
Moran, Mr. James                                             False
McCarthy, Mr. Timothy J                                       True
Palsson, Master. Gosta Leonard                               False
Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)            False
Nasser, Mrs. Nicholas (Adele Achem)                          False
Sandstrom, Miss. Marguerite Rut                              False
Bonnell, Miss. Elizabeth                                     False
Saundercock, Mr. William Henry                               False
Andersson, Mr. Anders Johan                                  False
Vestrom, Miss. Hulda Amanda Adolfina                         False
Hewlett, Mrs. (Mary D Kingcome)                              False
Rice, Master. Eugene                                         False
Williams, Mr. Charles Eugene                                 False
Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)      False
Masselmani, Mrs. Fatima                                      False
Fynney, Mr. Joseph J                                         False
Beesley, Mr. Lawrence                                        False
McGowan, Miss. Anna "Annie"                                  False
Sloper, Mr. William Thompson                                 False
Palsson, Miss. Torborg Danira                                False
Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)    False
Emir, Mr. Farred Chehab                                      False
Fortune, Mr. Charles Alexander                                True
O'Dwyer, Miss. Ellen "Nellie"                                False
Todoroff, Mr. Lalio                                          False
                                                             ...
Giles, Mr. Frederick Edward                                  False
Swift, Mrs. Frederick Joel (Margaret Welles Barron)          False
Sage, Miss. Dorothy Edith "Dolly"                             True
Gill, Mr. John William                                       False
Bystrom, Mrs. (Karolina)                                     False
Duran y More, Miss. Asuncion                                 False
Roebling, Mr. Washington Augustus II                          True
van Melkebeke, Mr. Philemon                                  False
Johnson, Master. Harold Theodor                              False
Balkic, Mr. Cerin                                            False
Beckwith, Mrs. Richard Leonard (Sallie Monypeny)              True
Carlsson, Mr. Frans Olof                                     False
Vander Cruyssen, Mr. Victor                                  False
Abelson, Mrs. Samuel (Hannah Wizosky)                        False
Najib, Miss. Adele Kiamie "Jane"                             False
Gustafsson, Mr. Alfred Ossian                                False
Petroff, Mr. Nedelio                                         False
Laleff, Mr. Kristo                                           False
Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)                 True
Shelley, Mrs. William (Imanita Parrish Hall)                 False
Markun, Mr. Johann                                           False
Dahlberg, Miss. Gerda Ulrika                                 False
Banfield, Mr. Frederick James                                False
Sutehall, Mr. Henry Jr                                       False
Rice, Mrs. William (Margaret Norton)                         False
Montvila, Rev. Juozas                                        False
Graham, Miss. Margaret Edith                                 False
Johnston, Miss. Catherine Helen "Carrie"                     False
Behr, Mr. Karl Howell                                        False
Dooley, Mr. Patrick                                          False
Name: Fare, Length: 891, dtype: bool

In [30]:
df2[df2['Fare'] > 40][:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S
"Fortune, Mr. Charles Alexander",28,0,1,male,19.0,3,2,19950,263.0000,C23 C25 C27,S
"Spencer, Mrs. William Augustus (Marie Eugenie)",32,1,1,female,NaN,1,0,PC 17569,146.5208,B78,C

In [31]:
df2[df2['Sex'] == 'male'][:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S
"Palsson, Master. Gosta Leonard",8,0,3,male,2.0,3,1,349909,21.0750,NaN,S

In [34]:
# df2.loc[df2['Sex']=='male', 'Age']

df2.loc[df2['Sex']=='male', 'Age'].mean()     # 性别为 male 的平均年龄

30.72664459161148

In [36]:
(df2['Age'] > 70).sum()

5

## groupby

In [38]:
df10 = pd.DataFrame({
    'key' : ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
    'data' : [0, 5, 10, 5, 10, 15, 10, 15, 20]
})
df10

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [40]:
for key in ['A', 'B', 'C']:
    print(key, df10[df10['key'] == key].sum())

A key     AAA
data     15
dtype: object
B key     BBB
data     30
dtype: object
C key     CCC
data     45
dtype: object

In [41]:
df10.groupby('key').sum()

     data
key
A      15
B      30
C      45

In [42]:
df3 = pd.read_csv('data/titanic/train.csv')

In [43]:
df3.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [44]:
df3.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [45]:
df3.corr()     # 相关系数

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [48]:
# df['Age'].value_counts()
df['Age'].value_counts(ascending = True)     # 注意: 是对统计结果进行排序

0.42      1
23.50     1
66.00     1
70.50     1
55.50     1
53.00     1
36.50     1
12.00     1
80.00     1
34.50     1
74.00     1
0.92      1
14.50     1
0.67      1
24.50     1
20.50     1
45.50     2
32.50     2
40.50     2
64.00     2
10.00     2
13.00     2
0.75      2
57.00     2
70.00     2
30.50     2
0.83      2
63.00     2
59.00     2
71.00     2
         ..
47.00     9
4.00     10
2.00     10
50.00    10
38.00    11
45.00    12
40.00    13
42.00    13
17.00    13
39.00    14
34.00    15
23.00    15
33.00    15
20.00    15
31.00    17
16.00    17
26.00    18
35.00    18
27.00    18
32.00    18
29.00    20
36.00    22
25.00    23
21.00    24
28.00    25
30.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: Age, Length: 88, dtype: int64

In [49]:
df['Age'].value_counts(ascending = True, bins = 5)    # bins 表示分成区间的个数

(64.084, 80.0]       11
(48.168, 64.084]     69
(0.339, 16.336]     100
(32.252, 48.168]    188
(16.336, 32.252]    346
Name: Age, dtype: int64

## get/set_option

In [51]:
pd.get_option('display.max_rows')
# pd.set_option('display.max_rows', 50)

60

In [52]:
pd.get_option('display.max_columns')
# pd.set_option('display.max_columns', 10)

20

In [53]:
pd.get_option('display.max_colwidth')
# pd.set_option('display.max_colwidth', 100)

50

In [54]:
pd.get_option('display.precision')
# pd.set_option('display.percision', 3)

6

## 数据透视表

In [55]:
example = pd.DataFrame({
    'Month' : ['January', 'January', 'January', 'January', 
               'February', 'February', 'February', 'February',
               'March', 'March', 'March', 'March'
              ],
    'Category' : ['Transportation', 'Grocery', 'Household', 'Entertainment', 
                  'Transportation', 'Grocery', 'Household', 'Entertainment', 
                  'Transportation', 'Grocery', 'Household', 'Entertainment', 
                ],
    'Amount' : [74., 235., 175., 100., 115., 240., 225., 125., 90., 260., 200., 120.]
})
example

       Month        Category  Amount
0    January  Transportation    74.0
1    January         Grocery   235.0
2    January       Household   175.0
3    January   Entertainment   100.0
4   February  Transportation   115.0
5   February         Grocery   240.0
6   February       Household   225.0
7   February   Entertainment   125.0
8      March  Transportation    90.0
9      March         Grocery   260.0
10     March       Household   200.0
11     March   Entertainment   120.0

In [60]:
example_pivot = example.pivot(index='Category', columns='Month', values='Amount')
example_pivot

Month           February  January  March
Category
Entertainment      125.0    100.0  120.0
Grocery            240.0    235.0  260.0
Household          225.0    175.0  200.0
Transportation     115.0     74.0   90.0

In [57]:
example_pivot.sum(axis=1)

Category
Entertainment     345.0
Grocery           735.0
Household         600.0
Transportation    279.0
dtype: float64

In [61]:
df4 = pd.read_csv('data/titanic/train.csv')

In [62]:
df4.pivot_table(index='Sex', columns='Pclass', values='Fare')    # 默认值就是返回平均值

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [63]:
df4.pivot_table(index='Sex', columns='Pclass', values='Fare', aggfunc='max')

Pclass         1     2      3
Sex
female  512.3292  65.0  69.55
male    512.3292  73.5  69.55

In [64]:
df4.pivot_table(index='Sex', columns='Pclass', values='Fare', aggfunc='count')

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [66]:
df4['Underaged'] = df['Age'] <= 18
df4.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Underaged
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,False
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,False
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,False
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,True
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,False
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,True

In [67]:
df4.pivot_table(index='Underaged', columns='Sex', values='Survived', aggfunc='mean')

Sex          female      male
Underaged
False      0.760163  0.167984
True       0.676471  0.338028

## 时间操作

In [68]:
ts = pd.Timestamp('2017-11-24')
ts

Timestamp('2017-11-24 00:00:00')

In [69]:
ts.month, ts.day

(11, 24)

In [70]:
ts + pd.Timedelta('5 days')

Timestamp('2017-11-29 00:00:00')

In [71]:
pd.to_datetime('2017-11-24')    # 将字符串转换成时间

Timestamp('2017-11-24 00:00:00')

In [72]:
pd.to_datetime('24/11/2017')

Timestamp('2017-11-24 00:00:00')

In [73]:
s = pd.Series(['2017-11-24 00:00:00', '2017-11-25 00:00:00', '2017-11-26 00:00:00'])
s

0    2017-11-24 00:00:00
1    2017-11-25 00:00:00
2    2017-11-26 00:00:00
dtype: object

In [75]:
ts = pd.to_datetime(s)
ts

0   2017-11-24
1   2017-11-25
2   2017-11-26
dtype: datetime64[ns]

In [80]:
# ts.dt.year      # 提取年份
# ts.dt.month     # 提取月份
# ts.dt.day       # 提取日期
ts.dt.weekday

0    4
1    5
2    6
dtype: int64

In [81]:
pd.Series(pd.date_range(start='2017-11-24', periods=10, freq='12H'))

0   2017-11-24 00:00:00
1   2017-11-24 12:00:00
2   2017-11-25 00:00:00
3   2017-11-25 12:00:00
4   2017-11-26 00:00:00
5   2017-11-26 12:00:00
6   2017-11-27 00:00:00
7   2017-11-27 12:00:00
8   2017-11-28 00:00:00
9   2017-11-28 12:00:00
dtype: datetime64[ns]

## 排序

In [82]:
data = pd.DataFrame({
    'group' : ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'c'],
    'data' : [4, 3, 2, 1, 12, 3, 4, 5, 7]
})
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

In [83]:
data.sort_values(by=['group', 'data'], ascending=[False, True], inplace=True)
data

  group  data
6     c     4
7     c     5
8     c     7
3     b     1
5     b     3
4     b    12
2     a     2
1     a     3
0     a     4

In [85]:
data = pd.DataFrame({
    'k1' : ['one'] * 3 + ['two'] * 4,
    'k2' : [3, 2, 1, 3, 3, 4, 4]
})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [86]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [88]:
data.drop_duplicates().sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
5  two   4

In [89]:
data.drop_duplicates(subset='k1')     # 删除 k1 中重复的数据

    k1  k2
0  one   3
3  two   3

In [90]:
data = pd.DataFrame({
    'food' : ['A1', 'A2', 'B1', 'B2', 'B3', 'C1', 'C2'],
    'data' : [1, 2, 3, 4, 5, 6, 7]
})
data

  food  data
0   A1     1
1   A2     2
2   B1     3
3   B2     4
4   B3     5
5   C1     6
6   C2     7

In [91]:
def food_map(series):
    if series['food'] == 'A1':
        return 'A'
    if series['food'] == 'A2':
        return 'A'
    if series['food'] == 'B1':
        return 'B'
    if series['food'] == 'B2':
        return 'B'
    if series['food'] == 'B3':
        return 'B'
    if series['food'] == 'C1':
        return 'C'
    if series['food'] == 'C2':
        return 'C'    
data['food_map'] = data.apply(food_map, axis='columns')
data

  food  data food_map
0   A1     1        A
1   A2     2        A
2   B1     3        B
3   B2     4        B
4   B3     5        B
5   C1     6        C
6   C2     7        C

In [93]:
food2Upper = {
    'A1' : 'A',
    'A2' : 'A',
    'B1' : 'B',
    'B2' : 'B',
    'B3' : 'B',
    'C1' : 'C',
    'C2' : 'C',    
}
data['upper'] = data['food'].map(food2Upper)
data

  food  data food_map upper
0   A1     1        A     A
1   A2     2        A     A
2   B1     3        B     B
3   B2     4        B     B
4   B3     5        B     B
5   C1     6        C     C
6   C2     7        C     C

In [94]:
df5 = pd.read_csv('data/titanic/train.csv')

In [95]:
def hundredth_row(columns):      # 获取第 100 行的数据
    item = columns.iloc[99]
    return item

hundredthRow = df5.apply(hundredth_row)
hundredthRow

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                           34
SibSp                          1
Parch                          0
Ticket                    244367
Fare                          26
Cabin                        NaN
Embarked                       S
dtype: object

In [96]:
def null_count(columns):
    columns_null = pd.isnull(columns)
    null = columns[columns_null]
    return len(null)

columns_null_count = df5.apply(null_count)
columns_null_count

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [107]:
def which_class(row):
    pclass = row['Pclass']
    if pd.isnull(pclass):
        return 'Unknow'
    elif pclass == 1:
        return 'First class'
    elif pclass == 2:
        return 'Second class'
    elif pclass == 3:
        return 'Third class'
    
classes = df5.apply(which_class, axis=1)
classes.head(10)

0     Third class
1     First class
2     Third class
3     First class
4     Third class
5     Third class
6     First class
7     Third class
8     Third class
9    Second class
dtype: object

In [109]:
def is_minor(row):
    if row['Age'] < 18:
        return True
    else:
        return False
    
minors = df5.apply(is_minor, axis=1)
minors.head(10)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

## 字符串操作

In [110]:
s = pd.Series(['A', 'b', 'B', 'gear', 'AGER', np.nan])
s

0       A
1       b
2       B
3    gear
4    AGER
5     NaN
dtype: object

In [111]:
s.str.lower()
# s.str.upper()
# s.str.len()
# s.str.strip()
# s.str.lstrip()
# s.str.rstrip()

0       a
1       b
2       b
3    gear
4    ager
5     NaN
dtype: object

In [119]:
df11 = pd.DataFrame(np.random.randn(3, 2), columns=['A a', 'B b'], index=range(3))
df11

        A a       B b
0 -0.432182 -0.002853
1 -0.818309 -0.312957
2  0.453394  0.012514

In [120]:
df11.columns = df11.columns.str.replace(' ', '-')
df11

        A-a       B-b
0 -0.432182 -0.002853
1 -0.818309 -0.312957
2  0.453394  0.012514

In [121]:
s = pd.Series(['a_b_C', 'c_d_e', 'f_g_h'])
s

0    a_b_C
1    c_d_e
2    f_g_h
dtype: object

In [122]:
s.str.split("_")

0    [a, b, C]
1    [c, d, e]
2    [f, g, h]
dtype: object

In [123]:
s.str.split("_", expand=True)

   0  1  2
0  a  b  C
1  c  d  e
2  f  g  h

In [124]:
s.str.split("_", expand=True, n=1)

   0    1
0  a  b_C
1  c  d_e
2  f  g_h

In [125]:
s = pd.Series(['A', 'Aas', 'Afgew', 'Ager', 'Agre', 'Ager'])
s

0        A
1      Aas
2    Afgew
3     Ager
4     Agre
5     Ager
dtype: object

In [126]:
s.str.contains('Ag')

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool